# 1. მათემატიკური ოპერაციები

#+ (მიმატება): კრებს ორ რიცხვს. მაგალითად: 5 + 3 გამოიტანს 8-ს.
#- (გამოკლება): აკლებს მეორე რიცხვს პირველს. მაგალითად: 10 - 4 გამოიტანს 6-ს.
#* (გამრავლება): ამრავლებს რიცხვებს ერთმანეთზე. მაგალითად: 4 * 2 გამოიტანს 8-ს.
#/ (გაყოფა): ყოფს რიცხვებს და შედეგი ყოველთვის არის ათწილადი (float). მაგალითად: 10 / 2 გამოიტანს 5.0-ს.
#// (მთლიანი გაყოფა): ყოფს რიცხვებს და ტოვებს მხოლოდ მთელ ნაწილს (ნაშთს გადააგდებს). მაგალითად: 10 // 3 გამოიტანს 3-ს.
#% (ნაშთით გაყოფა): აბრუნებს გაყოფის შედეგად დარჩენილ ნაშთს. მაგალითად: 10 % 3 გამოიტანს 1-ს.
#** (ხარისხში აყვანა): რიცხვი აჰყავს მითითებულ ხარისხში. მაგალითად: 2 ** 3 (2 კუბში) გამოიტანს 8-ს.


# 2. რიცხვის კვადრატი და კუბი

number = float(input("შემოიყვანეთ რიცხვი: "))

square = number ** 2
cube = number ** 3

print(f"რიცხვის კვადრატი: {square}")
print(f"რიცხვის კუბი: {cube}")

# 3. ორი რიცხვი და ყველა მათემატიკური ოპერაცია
a = float(input("შემოიყვანეთ პირველი რიცხვი"))
b = float(input("შემოიყვანეთ მეორე რიცხვი"))

print("მიმატება:"a + b)
print("გამოკლება:" a - b)
print("გამრავლება:" a * b)
print("გაყოფა:" a / b)
print("მთლიანი გაყოფა:" a // b)
print("ნაშთი გაყოფისას:" a % b)
print("ხარისხში აყვანა:" a ** b)


# 4.კანფეტებიი
candies = int(input("დაწერეთ კანფეტების რაოდენობა:"))

boxes = candies // 12       # სრული ყუთების რაოდენობა
leftover = candies % 12     # დარჩენილი კანფეტები

print("სულ გაივსება ყუთი:", boxes)
print("დარჩება კანფეტი:", leftover)